tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"

# cli tools
brew "awscli"
brew "azure-cli"
brew "cmatrix"
brew "curl"
brew "difftastic"
brew "fastfetch"
brew "ffmpeg"
brew "gifski"
brew "git"
brew "heroku"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "make"
brew "nvim"
brew "openssl"
brew "poppler"
brew "pyenv-virtualenv"
brew "pyenv"
brew "rbenv"
brew "readline"
brew "resvg"
brew "ruby-build"
brew "sevenzip"
brew "starship"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vcprompt"
brew "vim"
brew "yazi"
brew "yq"
brew "zoxide"

# cli applications
cask "1password-cli"
cask "claude-code"

# gui applications
cask "1password"
cask "alfred"
cask "balenaetcher"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "dbeaver-community"
cask "discord"
cask "docker-desktop"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "iterm2"
cask "microsoft-edge"
cask "mongodb-compass"
cask "obsidian"
cask "postman"
cask "raspberry-pi-imager"
cask "slack"
cask "sync"
cask "transmission"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zed"
cask "zen"
cask "zoom"

# mac app store applications
mas "Gifski", id: 1351639930
mas "HP: Print and Support", id: 1474276998
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sound Studio", id: 405537804
