# cli tools
brew "cmatrix"
brew "curl"
brew "difftastic"
brew "git"
brew "heroku"
brew "htop"
brew "lazygit"
brew "make"
brew "nvim"
brew "openssl"
brew "pyenv-virtualenv"
brew "pyenv"
brew "rbenv"
brew "readline"
brew "ruby-build"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"

# cli applications
cask "1password-cli"
cask "claude-code"

# gui applications
cask "1password"
cask "alfred"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "dbeaver-community"
cask "discord"
cask "docker-desktop"
cask "google-chrome"
cask "iterm2"
cask "microsoft-edge"
cask "mongodb-compass"
cask "obsidian"
cask "postman"
cask "slack"
cask "sync"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zed"
cask "zen"
cask "zoom"
